Revit 2024 API
DisplacementElement.IsValidAsParentInView Method
 Indicates whether the specified DisplacementElement can be used as a parent when creating a DisplacementElement in the specified view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool IsValidAsParentInView(
	View view,
	DisplacementElement parent
)
Visual Basic
Public Shared Function IsValidAsParentInView ( _
	view As View, _
	parent As DisplacementElement _
) As Boolean
Visual C++
public:
static bool IsValidAsParentInView(
	View^ view,
	DisplacementElement^ parent
)
Parameters
view
Type: Autodesk.Revit.DB.View
 A view.
parent
Type: Autodesk.Revit.DB.DisplacementElement
 A DisplacementElement.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace